RSN/src/InformationRegisters/НагрузкаSQLСерверов/НагрузкаSQLСерверов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НагрузкаSQLСерверов</name>
  <resources>
    <name>КоличествоВызовов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗагрузкаПроцессора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлительностьЗагрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗагрузкаПроцессораПроцент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлительностьЗагрузкиПроцент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СерверБазыДанных</name>
    <type>
      <types>CatalogRef.СерверыБазДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаДанных</name>
    <type>
      <types>CatalogRef.БазыДанных</types>
    </type>
  </attributes>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>База</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RSN/src/InformationRegisters/НагрузкаSQLСерверов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
// Сопоставляет поля в новые реквизиты регистра. база и сервер из Строки в Ссылочные типы. 
//
Процедура СопоставитьПоляДляБазыИСервераSQL() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ 		
	|	НагрузкаSQLСерверов.Дата КАК Дата,
	|	НагрузкаSQLСерверов.Сервер КАК Сервер,
	|	НагрузкаSQLСерверов.База КАК База,
	|	ЕСТЬNULL(БазыДанных.Ссылка, НагрузкаSQLСерверов.База) КАК БазаДанных,
	|	ЕСТЬNULL(СерверыБазДанных.Ссылка, НагрузкаSQLСерверов.Сервер) КАК СерверБазыДанных
	|ИЗ
	|	РегистрСведений.НагрузкаSQLСерверов КАК НагрузкаSQLСерверов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БазыДанных КАК БазыДанных
	|		ПО НагрузкаSQLСерверов.База = БазыДанных.Наименование И
	|		НагрузкаSQLСерверов.Сервер = БазыДанных.Владелец.Наименование
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерверыБазДанных КАК СерверыБазДанных
	|		ПО НагрузкаSQLСерверов.Сервер = СерверыБазДанных.Наименование
	|ГДЕ
	|	НагрузкаSQLСерверов.СерверБазыДанных = ЗНАЧЕНИЕ(Справочник.СерверыБазДанных.ПустаяСсылка)
	|ИТОГИ ПО
	|	СерверБазыДанных,
	|	БазаДанных"; 
	ВыборкаСервер = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСервер.Следующий() Цикл
		СерверБазыДанных = ВыборкаСервер.СерверБазыДанных;
		Если ТипЗнч(СерверБазыДанных) = Тип("Строка") Тогда
			СерверБазыДанных = НовыйСерверБазыДанных(СерверБазыДанных);
		КонецЕсли;
		ВыборкаБаза = ВыборкаСервер.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
		Пока ВыборкаБаза.Следующий() Цикл
			БазаДанных = ВыборкаБаза.БазаДанных;
			Если ТипЗнч(БазаДанных) = Тип("Строка") Тогда
				БазаДанных = НовыйБазаДанных(БазаДанных, СерверБазыДанных);
			КонецЕсли;
			Выборка = ВыборкаБаза.Выбрать();
			Пока Выборка.Следующий() Цикл
				МЗ = РегистрыСведений.НагрузкаSQLСерверов.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(МЗ, Выборка, "Дата, Сервер, База");
				МЗ.Прочитать();
				Если Не МЗ.Выбран() Тогда
					Возврат;
				КонецЕсли; 
				МЗ.СерверБазыДанных = СерверБазыДанных;
				МЗ.БазаДанных = БазаДанных;
				МЗ.Записать();
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция НовыйСерверБазыДанных(Сервер)
	ОбъектСерверБазыДанных = Справочники.СерверыБазДанных.СоздатьЭлемент();
	ОбъектСерверБазыДанных.Наименование = Сервер;
	ОбъектСерверБазыДанных.Записать();
	Возврат ОбъектСерверБазыДанных.Ссылка;
КонецФункции  

Функция НовыйБазаДанных(База, СерверБазыДанных)
	ОбъектБазыДанных = Справочники.БазыДанных.СоздатьЭлемент(); 
	ОбъектБазыДанных.Наименование = База;
	ОбъектБазыДанных.Владелец = СерверБазыДанных;
	ОбъектБазыДанных.Записать();
	Возврат ОбъектБазыДанных.Ссылка;
КонецФункции
#КонецОбласти

#КонецЕсли
